In [1]:
import pandas as pd
import datetime as dt
from config import key

In [2]:
Disney_url = "DisneylandReviews.csv"
Happiness_url = "World_Happiness_Report_2018.csv"

In [3]:
disney = pd.read_csv(Disney_url, encoding='latin-1')
happiness = pd.read_csv(Happiness_url, encoding='latin-1')

In [4]:
disney.head()

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong

In [5]:
disney = disney.loc[disney["Year_Month"]!="missing",:]

In [6]:
disney["year"] = disney["Year_Month"].str.split(pat="-", expand=True)[0]

In [7]:
disney["year"] = disney["year"].astype(int)

In [8]:
disney.head()

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch,year
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong,2019
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong,2019
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong,2019
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong,2019
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong,2019

In [9]:
disney.dtypes

Review_ID             int64
Rating                int64
Year_Month           object
Reviewer_Location    object
Review_Text          object
Branch               object
year                  int32
dtype: object

In [10]:
disney.columns

Index(['Review_ID', 'Rating', 'Year_Month', 'Reviewer_Location', 'Review_Text',
       'Branch', 'year'],
      dtype='object')

In [11]:
disney = disney.rename(columns={'Review_ID':'id','Rating':'rating','Reviewer_Location':'country', 'Review_Text':'review','Branch':'park'})

In [12]:
disney.head()

,id,rating,Year_Month,country,review,park,year
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong,2019
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong,2019
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong,2019
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong,2019
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong,2019

In [13]:
disney = disney.drop(columns="Year_Month")

In [14]:
disney_2018 = disney.loc[disney["year"]==2018,:]

In [15]:
disney_2018.count()

id         3997
rating     3997
country    3997
review     3997
park       3997
year       3997
dtype: int64

In [16]:
disney_countries = list(set(disney_2018["country"].to_list()))

In [17]:
happiness_countries = list(set(happiness["Country or region"].to_list()))

In [18]:
happiness[~happiness["Country or region"].isin(disney_countries)]

,Overall rank,Country or region,Score,GDP per capita,Social support,Healthy life expectancy,Freedom to make life choices,Generosity,Perceptions of corruption
3,4,Iceland,7.495,1.343,1.644,0.914,0.677,0.353,0.138
11,12,Austria,7.139,1.341,1.504,0.891,0.617,0.242,0.224
12,13,Costa Rica,7.072,1.010,1.459,0.817,0.632,0.143,0.101
16,17,Luxembourg,6.910,1.576,1.520,0.896,0.632,0.196,0.321
26,27,Panama,6.430,1.112,1.438,0.759,0.597,0.125,0.063
...,...,...,...,...,...,...,...,...,...
151,152,Yemen,3.355,0.442,1.073,0.343,0.244,0.083,0.064
152,153,Tanzania,3.303,0.455,0.991,0.381,0.481,0.270,0.097
153,154,South Sudan,3.254,0.337,0.608,0.177,0.112,0.224,0.106
154,155,Central African Republic,3.083,0.024,0.000,0.010,0.305,0.218,0.038
155,156,Burundi,2.905,0.091,0.627,0.145,0.065,0.149,0.076

In [19]:
disney_2018[~disney_2018["country"].isin(happiness_countries)]["country"].unique()

array(['Macau', 'Oman', 'Brunei', 'Maldives'], dtype=object)

In [20]:
disney_2018 = disney_2018.loc[disney_2018["country"]!="Macau",:]

In [21]:
disney_2018 = disney_2018.loc[disney_2018["country"]!="Oman",:]

In [22]:
disney_2018 = disney_2018.loc[disney_2018["country"]!="Brunei",:]

In [23]:
disney_2018 = disney_2018.loc[disney_2018["country"]!="Maldives",:]

In [24]:
disney_2018.head()

,id,rating,country,review,park,year
14,670274554,5,Australia,This place is HUGE! Definately need more than ...,Disneyland_HongKong,2018
19,670033848,5,Hong Kong,There is nothing more to say except that you b...,Disneyland_HongKong,2018
27,669403596,5,Philippines,We have been to Hong Kong Disneyland a few tim...,Disneyland_HongKong,2018
34,668777351,4,Australia,"We have been to Disneyland in LA two times, an...",Disneyland_HongKong,2018
38,668209978,5,Australia,You have to visit to understand the memorable ...,Disneyland_HongKong,2018

In [25]:
disney_2018[~disney_2018["country"].isin(happiness_countries)]["country"].unique()

array([], dtype=object)

In [26]:
happiness.head()

,Overall rank,Country or region,Score,GDP per capita,Social support,Healthy life expectancy,Freedom to make life choices,Generosity,Perceptions of corruption
0,1,Finland,7.632,1.305,1.592,0.874,0.681,0.202,0.393
1,2,Norway,7.594,1.456,1.582,0.861,0.686,0.286,0.340
2,3,Denmark,7.555,1.351,1.590,0.868,0.683,0.284,0.408
3,4,Iceland,7.495,1.343,1.644,0.914,0.677,0.353,0.138
4,5,Switzerland,7.487,1.420,1.549,0.927,0.660,0.256,0.357

In [27]:
happiness.columns

Index(['Overall rank', 'Country or region', 'Score', 'GDP per capita',
       'Social support', 'Healthy life expectancy',
       'Freedom to make life choices', 'Generosity',
       'Perceptions of corruption'],
      dtype='object')

In [28]:
happiness.dtypes

Overall rank                      int64
Country or region                object
Score                           float64
GDP per capita                  float64
Social support                  float64
Healthy life expectancy         float64
Freedom to make life choices    float64
Generosity                      float64
Perceptions of corruption       float64
dtype: object

In [29]:
happiness = happiness.rename(columns={'Overall rank':'happiness_ranking', 'Country or region':'country', 'Score':'happiness_score', 'GDP per capita':'gdp_per_capita',
       'Social support':'social_support', 'Healthy life expectancy':'life_expectancy',
       'Freedom to make life choices':'freedom', 'Generosity':'generosity',
       'Perceptions of corruption':'perceived_corruption'})

In [30]:
happiness.columns

Index(['happiness_ranking', 'country', 'happiness_score', 'gdp_per_capita',
       'social_support', 'life_expectancy', 'freedom', 'generosity',
       'perceived_corruption'],
      dtype='object')

In [31]:
happiness.head()

,happiness_ranking,country,happiness_score,gdp_per_capita,social_support,life_expectancy,freedom,generosity,perceived_corruption
0,1,Finland,7.632,1.305,1.592,0.874,0.681,0.202,0.393
1,2,Norway,7.594,1.456,1.582,0.861,0.686,0.286,0.340
2,3,Denmark,7.555,1.351,1.590,0.868,0.683,0.284,0.408
3,4,Iceland,7.495,1.343,1.644,0.914,0.677,0.353,0.138
4,5,Switzerland,7.487,1.420,1.549,0.927,0.660,0.256,0.357

In [33]:
from sqlalchemy import create_engine

In [43]:
connection_string = f"postgres:{key}@localhost:5432/disney_db"
engine = create_engine(f'postgresql://{connection_string}')

In [44]:
engine.table_names()

['disney', 'happiness']

In [45]:
happiness.to_sql(name='happiness', con=engine, if_exists='append', index=False)
disney_2018.to_sql(name='disney', con=engine, if_exists='append', index=False)

In [46]:
pd.read_sql_query('select * from happiness', con=engine).head()

,id,happiness_ranking,country,happiness_score,gdp_per_capita,social_support,life_expectancy,freedom,generosity,perceived_corruption
0,1,1,Finland,7.632,1.305,1.592,0.874,0.681,0.202,0.393
1,2,2,Norway,7.594,1.456,1.582,0.861,0.686,0.286,0.340
2,3,3,Denmark,7.555,1.351,1.590,0.868,0.683,0.284,0.408
3,4,4,Iceland,7.495,1.343,1.644,0.914,0.677,0.353,0.138
4,5,5,Switzerland,7.487,1.420,1.549,0.927,0.660,0.256,0.357

In [47]:
pd.read_sql_query('select * from disney', con=engine).head()

,id,rating,country,review,park,year
0,670274554,5,Australia,This place is HUGE! Definately need more than ...,Disneyland_HongKong,2018
1,670033848,5,Hong Kong,There is nothing more to say except that you b...,Disneyland_HongKong,2018
2,669403596,5,Philippines,We have been to Hong Kong Disneyland a few tim...,Disneyland_HongKong,2018
3,668777351,4,Australia,"We have been to Disneyland in LA two times, an...",Disneyland_HongKong,2018
4,668209978,5,Australia,You have to visit to understand the memorable ...,Disneyland_HongKong,2018